tutorials/RAS/duneMigration3D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sedExnerFoam;

startFrom       startTime;

startTime       9;

stopAt          endTime;

endTime         10;

deltaT          4e-4;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii; //ascii; //binary;

writePrecision  6;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  off;

maxCo           0.8;

maxAlphaCo      0.3;

maxDeltaT       1e-3;

libs
(
     "libWilcoxOmegaWallFunction.so"
);

functions
{
};

// ************************************************************************* //
