tutorials/RAS/duneMigration3D/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type       zeroGradient;
    }
    outlet
    {
        type       fixedValue;
        value      uniform 0;
    }
    top
    {
        type       fixedFluxPressure;
	gradient   uniform 0;
    }
    bed
    {
	type 	   fixedFluxPressure;
	gradient   uniform 0;
    }
    sides
    {
        type       symmetry;
    }
}


// ************************************************************************* //
